Merge pull request #37 from felipesauer/audit/sec-perf-findings
audit/sec-perf-findings
